Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCannotApplyDivideSettings Property
 Default Divide settings were not applied to Divided Surface. Please adjust grid spacing values manually.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceCannotApplyDivideSettings { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceCannotApplyDivideSettings As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceCannotApplyDivideSettings {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace